[
  "<image> Please provide the segmentation mask for <expr>.",
  "<image> I need the segmentation mask specifically for <expr>.",
  "<image> Could you generate a segmentation mask that isolates <expr> from the image?",
  "<image> Segment only <expr> from the image and generate the corresponding mask.",
  "<image> Generate a segmentation mask that highlights only <expr> in the image.",
  "<image> I'm looking for a segmentation mask that focuses on <expr>. Can you assist me with that?",
  "<image> Is it possible to obtain a segmentation mask for <expr> from the given image?",
  "<image> Extract the segment containing <expr> and generate its corresponding mask.",
  "<image> I'd like to obtain a segmentation mask that accurately represents <expr> in the image.",
  "<image> Please create a segmentation mask that highlights the region corresponding to <expr>.",
  "<image> I'm interested in isolating <expr> from the image. Could you provide a segmentation mask for that?",
  "<image> It would be helpful if you could create a segmentation mask highlighting only <expr> in the image.",
  "<image> I need a segmentation mask that accurately represents the region corresponding to <expr> in the image.",
  "<image> Please generate a segmentation mask that clearly separates <expr> from the rest of the image.",
  "<image> Could you create a segmentation mask that highlights the area where <expr> is present in the image?",
  "<image> I would like a segmentation mask that precisely outlines the boundaries of <expr> in the image.",
  "<image> Generate a segmentation mask that emphasizes the presence of <expr> in the image.",
  "<image> Is it possible to obtain a segmentation mask specifically focusing on <expr> in the image?",
  "<image> I'm looking for a segmentation mask that accurately identifies the region containing <expr> in the image.",
  "<image> Please generate a segmentation mask that highlights the precise location of <expr> in the image.",
  "<image> I need a segmentation mask that isolates and labels the area corresponding to <expr> in the image.",
  "<image> Could you create a segmentation mask that precisely outlines the region where <expr> appears in the image?",
  "<image> Please create a segmentation mask that accurately captures the spatial extent of <expr> in the image.",
  "<image> Could you generate a segmentation mask that focuses on the most salient areas related to <expr> in the image?",
  "<image> I'm interested in obtaining a segmentation mask that distinguishes <expr> from other objects in the image.",
  "<image> Please provide a segmentation mask that highlights the specific features of <expr> in the image.",
  "<image> Generate a segmentation mask that accurately represents the shape and boundaries of <expr> in the image."
]